detail_data/k6関係/10000_10_2NT.txt

     data_received..................: 20 GB  299 MB/s
     data_sent......................: 860 kB 13 kB/s
     http_req_blocked...............: avg=39.84µs  min=0s      med=0s      max=25.64ms  p(90)=0s      p(95)=0s     
     http_req_connecting............: avg=9.42µs   min=0s      med=0s      max=10.1ms   p(90)=0s      p(95)=0s     
     http_req_duration..............: avg=66.52ms  min=43.52ms med=63.08ms max=181.19ms p(90)=85.42ms p(95)=94.23ms
       { expected_response:true }...: avg=66.52ms  min=43.52ms med=63.08ms max=181.19ms p(90)=85.42ms p(95)=94.23ms
     http_req_failed................: 0.00%  0 out of 10000
     http_req_receiving.............: avg=24.74ms  min=6.04ms  med=21.74ms max=98.41ms  p(90)=39.88ms p(95)=46.58ms
     http_req_sending...............: avg=251.19µs min=0s      med=0s      max=42.83ms  p(90)=0s      p(95)=1.01ms 
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s       p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=41.53ms  min=29.24ms med=39.09ms max=139.93ms p(90)=50.12ms p(95)=57.28ms
     http_reqs......................: 10000  147.93885/s
     iteration_duration.............: avg=66.94ms  min=43.52ms med=63.48ms max=181.19ms p(90)=86.01ms p(95)=95.28ms
     iterations.....................: 10000  147.93885/s
     vus............................: 7      min=7          max=10
     vus_max........................: 10     min=10         max=10


     data_received..................: 20 GB  298 MB/s
     data_sent......................: 860 kB 13 kB/s
     http_req_blocked...............: avg=36.65µs  min=0s      med=0s      max=23.71ms  p(90)=0s      p(95)=0s     
     http_req_connecting............: avg=11.04µs  min=0s      med=0s      max=7ms      p(90)=0s      p(95)=0s     
     http_req_duration..............: avg=67.02ms  min=29.12ms med=63.37ms max=171.28ms p(90)=86.05ms p(95)=95.16ms
       { expected_response:true }...: avg=67.02ms  min=29.12ms med=63.37ms max=171.28ms p(90)=86.05ms p(95)=95.16ms
     http_req_failed................: 0.00%  0 out of 10000
     http_req_receiving.............: avg=25.02ms  min=0s      med=22.04ms max=114.26ms p(90)=39.98ms p(95)=45.63ms
     http_req_sending...............: avg=251.65µs min=0s      med=0s      max=50.55ms  p(90)=0s      p(95)=1ms    
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s       p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=41.74ms  min=989.2µs med=39.2ms  max=124.56ms p(90)=50.99ms p(95)=58.13ms
     http_reqs......................: 10000  147.445689/s
     iteration_duration.............: avg=67.42ms  min=29.12ms med=63.71ms max=171.28ms p(90)=86.74ms p(95)=95.79ms
     iterations.....................: 10000  147.445689/s
     vus............................: 9      min=9          max=10
     vus_max........................: 10     min=10         max=10


     data_received..................: 20 GB  298 MB/s
     data_sent......................: 860 kB 13 kB/s
     http_req_blocked...............: avg=40.13µs  min=0s      med=0s      max=23.09ms  p(90)=0s      p(95)=0s     
     http_req_connecting............: avg=13.81µs  min=0s      med=0s      max=23.09ms  p(90)=0s      p(95)=0s     
     http_req_duration..............: avg=67.05ms  min=15.98ms med=63.77ms max=185.53ms p(90)=85.83ms p(95)=93.64ms
       { expected_response:true }...: avg=67.05ms  min=15.98ms med=63.77ms max=185.53ms p(90)=85.83ms p(95)=93.64ms
     http_req_failed................: 0.00%  0 out of 10000
     http_req_receiving.............: avg=25.76ms  min=0s      med=22.93ms max=106.63ms p(90)=41.16ms p(95)=47.1ms 
     http_req_sending...............: avg=252.01µs min=0s      med=0s      max=38.28ms  p(90)=0s      p(95)=1.01ms 
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s       p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=41.03ms  min=14.67ms med=38.88ms max=153.54ms p(90)=49.12ms p(95)=55.68ms
     http_reqs......................: 10000  147.603891/s
     iteration_duration.............: avg=67.42ms  min=15.98ms med=64.09ms max=185.52ms p(90)=86.33ms p(95)=94.3ms 
     iterations.....................: 10000  147.603891/s
     vus............................: 9      min=9          max=10
     vus_max........................: 10     min=10         max=10


     data_received..................: 20 GB  295 MB/s
     data_sent......................: 860 kB 13 kB/s
     http_req_blocked...............: avg=38.04µs min=0s      med=0s      max=16.88ms  p(90)=0s      p(95)=0s     
     http_req_connecting............: avg=11.93µs min=0s      med=0s      max=12.01ms  p(90)=0s      p(95)=0s     
     http_req_duration..............: avg=67.73ms min=44.52ms med=63.84ms max=190.63ms p(90)=88.63ms p(95)=98.21ms
       { expected_response:true }...: avg=67.73ms min=44.52ms med=63.84ms max=190.63ms p(90)=88.63ms p(95)=98.21ms
     http_req_failed................: 0.00%  0 out of 10000
     http_req_receiving.............: avg=25.72ms min=1.11ms  med=22.3ms  max=113.82ms p(90)=42.42ms p(95)=49.48ms
     http_req_sending...............: avg=265.8µs min=0s      med=0s      max=127.31ms p(90)=0s      p(95)=1.01ms 
     http_req_tls_handshaking.......: avg=0s      min=0s      med=0s      max=0s       p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=41.74ms min=23.44ms med=39.4ms  max=149.73ms p(90)=50.31ms p(95)=57.14ms
     http_reqs......................: 10000  145.784104/s
     iteration_duration.............: avg=68.15ms min=44.52ms med=64.17ms max=190.63ms p(90)=89.36ms p(95)=98.67ms
     iterations.....................: 10000  145.784104/s
     vus............................: 8      min=8          max=10
     vus_max........................: 10     min=10         max=10


     data_received..................: 20 GB  296 MB/s
     data_sent......................: 860 kB 13 kB/s
     http_req_blocked...............: avg=44.84µs  min=0s      med=0s      max=45.21ms  p(90)=0s      p(95)=0s     
     http_req_connecting............: avg=13.74µs  min=0s      med=0s      max=20.01ms  p(90)=0s      p(95)=0s     
     http_req_duration..............: avg=67.17ms  min=18.46ms med=63.87ms max=162.64ms p(90)=87.21ms p(95)=95.47ms
       { expected_response:true }...: avg=67.17ms  min=18.46ms med=63.87ms max=162.64ms p(90)=87.21ms p(95)=95.47ms
     http_req_failed................: 0.00%  0 out of 10000
     http_req_receiving.............: avg=25.84ms  min=0s      med=22.68ms max=118.4ms  p(90)=42.93ms p(95)=49.4ms 
     http_req_sending...............: avg=231.27µs min=0s      med=0s      max=79.04ms  p(90)=0s      p(95)=996.2µs
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s       p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=41.09ms  min=1.99ms  med=39.25ms max=143.58ms p(90)=48.61ms p(95)=54.03ms
     http_reqs......................: 10000  146.270472/s
     iteration_duration.............: avg=67.53ms  min=18.46ms med=64.18ms max=162.63ms p(90)=87.89ms p(95)=95.98ms
     iterations.....................: 10000  146.270472/s
     vus............................: 2      min=2          max=10
     vus_max........................: 10     min=10         max=10


     data_received..................: 20 GB  302 MB/s
     data_sent......................: 860 kB 13 kB/s
     http_req_blocked...............: avg=28.68µs  min=0s      med=0s      max=26.84ms  p(90)=0s      p(95)=0s     
     http_req_connecting............: avg=9.89µs   min=0s      med=0s      max=26.74ms  p(90)=0s      p(95)=0s     
     http_req_duration..............: avg=66.05ms  min=39.22ms med=62.2ms  max=157.11ms p(90)=86.29ms p(95)=95ms   
       { expected_response:true }...: avg=66.05ms  min=39.22ms med=62.2ms  max=157.11ms p(90)=86.29ms p(95)=95ms   
     http_req_failed................: 0.00%  0 out of 10000
     http_req_receiving.............: avg=24.47ms  min=5.2ms   med=20.96ms max=115.21ms p(90)=40.94ms p(95)=48.11ms
     http_req_sending...............: avg=190.87µs min=0s      med=0s      max=57.03ms  p(90)=0s      p(95)=990.8µs
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s       p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=41.39ms  min=15.98ms med=39.36ms max=116.8ms  p(90)=49.62ms p(95)=55.63ms
     http_reqs......................: 10000  149.219691/s
     iteration_duration.............: avg=66.37ms  min=39.22ms med=62.49ms max=188.09ms p(90)=86.7ms  p(95)=95.36ms
     iterations.....................: 10000  149.219691/s
     vus............................: 1      min=1          max=10
     vus_max........................: 10     min=10         max=10


     data_received..................: 20 GB  300 MB/s
     data_sent......................: 860 kB 13 kB/s
     http_req_blocked...............: avg=29.23µs  min=0s      med=0s      max=17ms     p(90)=0s      p(95)=0s     
     http_req_connecting............: avg=12.22µs  min=0s      med=0s      max=17ms     p(90)=0s      p(95)=0s     
     http_req_duration..............: avg=66.36ms  min=43.43ms med=63.4ms  max=167.22ms p(90)=83.54ms p(95)=91.37ms
       { expected_response:true }...: avg=66.36ms  min=43.43ms med=63.4ms  max=167.22ms p(90)=83.54ms p(95)=91.37ms
     http_req_failed................: 0.00%  0 out of 10000
     http_req_receiving.............: avg=25.08ms  min=6.52ms  med=22.53ms max=127.58ms p(90)=39.25ms p(95)=44.99ms
     http_req_sending...............: avg=193.73µs min=0s      med=0s      max=38ms     p(90)=0s      p(95)=1ms    
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s       p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=41.08ms  min=7.47ms  med=39.13ms max=108.43ms p(90)=48.91ms p(95)=54.48ms
     http_reqs......................: 10000  148.385905/s
     iteration_duration.............: avg=66.66ms  min=43.43ms med=63.73ms max=167.21ms p(90)=83.86ms p(95)=92.09ms
     iterations.....................: 10000  148.385905/s
     vus............................: 2      min=2          max=10
     vus_max........................: 10     min=10         max=10


     data_received..................: 20 GB  301 MB/s
     data_sent......................: 860 kB 13 kB/s
     http_req_blocked...............: avg=35.86µs  min=0s      med=0s      max=11.71ms  p(90)=0s      p(95)=0s     
     http_req_connecting............: avg=9.96µs   min=0s      med=0s      max=9.98ms   p(90)=0s      p(95)=0s     
     http_req_duration..............: avg=66.44ms  min=43.86ms med=63.93ms max=152.78ms p(90)=82.25ms p(95)=89.5ms 
       { expected_response:true }...: avg=66.44ms  min=43.86ms med=63.93ms max=152.78ms p(90)=82.25ms p(95)=89.5ms 
     http_req_failed................: 0.00%  0 out of 10000
     http_req_receiving.............: avg=25.92ms  min=6.97ms  med=23.72ms max=111.07ms p(90)=39.58ms p(95)=44.72ms
     http_req_sending...............: avg=178.07µs min=0s      med=0s      max=28.94ms  p(90)=0s      p(95)=992.9µs
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s       p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=40.34ms  min=26.13ms med=38.78ms max=99.36ms  p(90)=47.08ms p(95)=51.66ms
     http_reqs......................: 10000  149.00704/s
     iteration_duration.............: avg=66.76ms  min=43.86ms med=64.28ms max=153.32ms p(90)=82.75ms p(95)=90.11ms
     iterations.....................: 10000  149.00704/s
     vus............................: 2      min=2          max=10
     vus_max........................: 10     min=10         max=10


     data_received..................: 20 GB  296 MB/s
     data_sent......................: 860 kB 13 kB/s
     http_req_blocked...............: avg=34.21µs  min=0s     med=0s      max=12.36ms  p(90)=0s      p(95)=0s     
     http_req_connecting............: avg=9.12µs   min=0s     med=0s      max=5.99ms   p(90)=0s      p(95)=0s     
     http_req_duration..............: avg=67.33ms  min=6.98ms med=63.81ms max=218.3ms  p(90)=86.3ms  p(95)=95.8ms 
       { expected_response:true }...: avg=67.33ms  min=6.98ms med=63.81ms max=218.3ms  p(90)=86.3ms  p(95)=95.8ms 
     http_req_failed................: 0.00%  0 out of 10000
     http_req_receiving.............: avg=25.55ms  min=0s     med=22.52ms max=162.96ms p(90)=40.98ms p(95)=47.68ms
     http_req_sending...............: avg=210.48µs min=0s     med=0s      max=33.15ms  p(90)=0s      p(95)=1ms    
     http_req_tls_handshaking.......: avg=0s       min=0s     med=0s      max=0s       p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=41.56ms  min=0s     med=39.2ms  max=162.14ms p(90)=50.14ms p(95)=56.8ms 
     http_reqs......................: 10000  146.658661/s
     iteration_duration.............: avg=67.69ms  min=6.98ms med=64.09ms max=218.3ms  p(90)=86.91ms p(95)=96.12ms
     iterations.....................: 10000  146.658661/s
     vus............................: 3      min=3          max=10
     vus_max........................: 10     min=10         max=10


     data_received..................: 20 GB  300 MB/s
     data_sent......................: 860 kB 13 kB/s
     http_req_blocked...............: avg=41.11µs  min=0s      med=0s      max=28.32ms  p(90)=0s      p(95)=0s     
     http_req_connecting............: avg=13.97µs  min=0s      med=0s      max=14.68ms  p(90)=0s      p(95)=0s     
     http_req_duration..............: avg=66.4ms   min=43.78ms med=62.59ms max=188.37ms p(90)=86.58ms p(95)=96.03ms
       { expected_response:true }...: avg=66.4ms   min=43.78ms med=62.59ms max=188.37ms p(90)=86.58ms p(95)=96.03ms
     http_req_failed................: 0.00%  0 out of 10000
     http_req_receiving.............: avg=24.68ms  min=2.01ms  med=21.46ms max=107.56ms p(90)=40.39ms p(95)=47.39ms
     http_req_sending...............: avg=271.53µs min=0s      med=0s      max=41.58ms  p(90)=0s      p(95)=1.03ms 
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s       p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=41.45ms  min=26.18ms med=38.92ms max=139.52ms p(90)=50.53ms p(95)=57.4ms 
     http_reqs......................: 10000  148.33388/s
     iteration_duration.............: avg=66.82ms  min=43.78ms med=63.02ms max=188.97ms p(90)=87.21ms p(95)=96.73ms
     iterations.....................: 10000  148.33388/s
     vus............................: 4      min=4          max=10
     vus_max........................: 10     min=10         max=10